spotlight_app_api/app/controllers/artworks_controller.rb

    def set_artwork
      @artwork = Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]